:PROPERTIES:
:ID:       fe57d179-5f2f-4956-9cbe-a45c26f80883
:END:
#+title: ENG231 - Electrical Machines And Transformers - Assesment 2 Lab 2
#+date: [2024-08-20 Tue 13:58]
#+AUTHOR: Baley Eccles - 652137
#+STARTUP: latexpreview

* ENG231 - Electrical Machines And Transformers - Assesment 2 Lab 2
#+BEGIN_SRC octave :export both :results output :session Part1
Velocity=[1.25490196078431,1.86937726369903,2.29885057471264,2.60162601626016];
EMFMax=[1.54,1.93,2.26,2.45];
EMFMin=[0.637,1.43,1.9,2.23];
plot(Velocity, EMFMax, 'b-', 'LineWidth', 3);
hold on;
plot(Velocity, EMFMin, 'r-', 'LineWidth', 3);
hold off;
xlabel('Velocity (m/s)', 'FontSize', 30);
ylabel('EMF (V)', 'FontSize', 30);
legend('EMF Max', 'EMF Min', 'FontSize', 20);
filename = sprintf('ENG231-Lab-2-Part-1.png');
print(filename,'-dpng','-r100');
#+END_SRC

#+RESULTS:

The core is taking some of the energy at high frequencies
Use a material with better conductivity
Or use plates to reduce eddy currents




#+BEGIN_SRC octave :export both :results output :session Part1
Freq=[20,40,60,80,100,120,140];
EMF=[75,112,133,155,165,182,195];
EMF=EMF.*10^-3
plot(Freq, EMF, 'b-', 'LineWidth', 3);
xlabel('Frequency (Hz)', 'FontSize', 30);
ylabel('EMF (V)', 'FontSize', 30);
legend('EMF vs Frequency', 'FontSize', 20);
filename = sprintf('ENG231-Lab-2-Part-2.png');
print(filename,'-dpng','-r100');
#+END_SRC

#+RESULTS:
: EMF =
:
:    0.075000   0.112000   0.133000   0.155000   0.165000   0.182000   0.195000
